#Область СлужебныеПроцедурыИФункции

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазыИОрганизации(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ПрефиксацияОбъектовСобытия.ПроверитьНомерДокументаПоДатеИОрганизации(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	ЗарплатаКадрыСоставДокументовСобытия.ЗаполнитьСоставСотрудниковДокументаПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр COVID_ДанныеОбОплаченныхСменах
	Движения.COVID_ДанныеОбОплаченныхСменах.Записывать = Истина;
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.COVID_ДанныеОбОплаченныхСменах.Добавить();
		Движение.Период = ПериодРегистрации;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.ДатаНачала = ТекСтрокаСотрудники.ДатаНачала;
		Движение.ДатаОкончания = ТекСтрокаСотрудники.ДатаОкончания;
		Движение.КоличествоСмен = ТекСтрокаСотрудники.КоличествоСмен;
		Движение.Подразделение = Подразделение;
		Движение.Должность = ТекСтрокаСотрудники.Должность;
		Движение.ДолжностьПоШтатномуРасписанию = ТекСтрокаСотрудники.ДолжностьПоШтатномуРасписанию;
		Движение.КоличествоСтавок = ТекСтрокаСотрудники.КоличествоСтавок;
		Движение.ФизическоеЛицо = ТекСтрокаСотрудники.ФизическоеЛицо;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ПроверяемыеРеквизиты.Добавить("Сотрудники.Подразделение");
	ПроверяемыеРеквизиты.Добавить("Сотрудники.ДатаНачала");
	ПроверяемыеРеквизиты.Добавить("Сотрудники.ДатаОкончания");
	ПроверяемыеРеквизиты.Добавить("Сотрудники.КоличествоСмен");
	ПроверяемыеРеквизиты.Добавить("Сотрудники.КоличествоСтавок");
	ПроверяемыеРеквизиты.Добавить("Сотрудники.ФизическоеЛицо");
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьШтатноеРасписание") Тогда
		ПроверяемыеРеквизиты.Добавить("Сотрудники.ДолжностьПоШтатномуРасписанию");
	Иначе
		ПроверяемыеРеквизиты.Добавить("Сотрудники.Должность");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
